src/main/resources/arca_intra_search_codice_arca.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:arca="http://arca.services.soa.sistinf.it">
    <soapenv:Header>
        <inps:Identity xmlns:inps="http://inps.it/">
            <AppName>%s</AppName>
            <AppKey>%s</AppKey>
            <UserId>%s</UserId>
            <IdentityProvider>%s</IdentityProvider>
        </inps:Identity>
    </soapenv:Header>
    <soapenv:Body>
        <arca:DiacRicercaConCodiceArcaRequest>
            <arca:Sicurezza>
                <arca:CodiceTipoOperatore>U</arca:CodiceTipoOperatore>
                <arca:Provenienza>PC</arca:Provenienza>
                <arca:CodiceFiscaleOperatore/>
                <arca:MatricolaINPS>%s</arca:MatricolaINPS>
                <arca:SedeRichiesta>003900</arca:SedeRichiesta>
                <arca:GestioneApplOrigine>XXX</arca:GestioneApplOrigine>
                <arca:SedeApplOrigine>003900</arca:SedeApplOrigine>
                <arca:PgmApplOrigine>%s</arca:PgmApplOrigine>
                <arca:TranApplOrigine>%s</arca:TranApplOrigine>
                <arca:Funzione>RO</arca:Funzione>
                <arca:WsReserved/>
            </arca:Sicurezza>
            <arca:Ricerca>
                <arca:Profilo>6</arca:Profilo>
                <arca:TipoChiavePresente>01</arca:TipoChiavePresente>
                <arca:ChiaveARCA>%s</arca:ChiaveARCA>
            </arca:Ricerca>
        </arca:DiacRicercaConCodiceArcaRequest>
    </soapenv:Body>
</soapenv:Envelope>
